       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULADORA.
      *****************************
      * AREA DE COMENTARIOS - REMARKS
      * AUTOR LUCAS OLIVEIRA DOS SANTOS (LOS)
      *OBJETIVO: FAZER UMA CALCULADORA
      *DATA = 29/09/25
      *****************************
       environment division.
       input-output section.
       file-control.
       data division.
       WORKING-STORAGE SECTION.

       01 WRK-NUM1 PICTURE 9(9). 
       01 WRK-NUM2 PICTURE 9(9).
       01 WRK-OPERACAO PICTURE 9(02).
       01 WRK-RESULTADO PICTURE 9(10).
       01 WRK-RESULTADO-FINAL PICTURE Z(10).

       PROCEDURE DIVISION.
       DISPLAY "INFORME UM NUMERO"
       ACCEPT WRK-NUM1. 
       DISPLAY "1=SOMA,2=SUBTRAÇÃO,3=MULTIPLICAÇÃO,4=DIVISÃO"
       ACCEPT WRK-OPERACAO.
       DISPLAY "INFORME OUTRO NUMERO"
       ACCEPT WRK-NUM2. 

       EVALUATE TRUE
        WHEN WRK-OPERACAO = 1
        ADD WRK-NUM1 WRK-NUM2 TO WRK-RESULTADO
        WHEN WRK-OPERACAO = 2
        SUBTRACT WRK-NUM1 FROM WRK-NUM2 GIVING WRK-RESULTADO
        WHEN WRK-OPERACAO = 3
        MULTIPLY WRK-NUM1 BY WRK-NUM2 GIVING WRK-RESULTADO
        WHEN WRK-OPERACAO = 4
        DIVIDE WRK-NUM1 BY WRK-NUM2 GIVING WRK-RESULTADO
       END-EVALUATE.
       MOVE WRK-RESULTADO TO WRK-RESULTADO-FINAL.
       DISPLAY "O RESULTADO É:" WRK-RESULTADO-FINAL.

       STOP RUN.




