       IDENTIFICATION DIVISION.
       PROGRAM-ID. teste.
      *****************************
      * AREA DE COMENTARIOS - REMARKS
      * AUTOR LUCAS OLIVEIRA DOS SANTOS (LOS)
      *OBJETIVO: RECEBER E IMPRIMIR A DATA DO SISTEMA
      *UTILIZAR VARIAVEIS NIVEL 01.02... (ESTRUTURADAS)
      *DATA = 10/09/2025
      *****************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WRK-DATA.
           02 WRK-ANO PIC 9(04) VALUE ZEROS.
           02 WRK-MES PIC 9(02) VALUE ZEROS.
           02 WRK-DIA PIC 9(02) VALUE ZEROS.
       77  WRK-NOME PICTURE X(20) VALUE SPACES.
       PROCEDURE DIVISION.
           ACCEPT WRK-DATA FROM DATE YYYYMMDD.
           DISPLAY "DATA DE HOJE "  WRK-DIA " DE " WRK-MES " DE " 
           WRK-ANO.
           STOP RUN.
