       IDENTIFICATION  DIVISION.
       PROGRAM-ID. TESTEN2-2.
      * COMENTARIO 
       ENVIRONMENT     DIVISION.
       DATA            DIVISION.
       WORKING-STORAGE SECTION.
       01  WRK-NOME    PICTURE X(20) VALUE SPACES.
       01  WRK-SALDO   PICTURE S9(05) VALUE ZEROS.

       PROCEDURE       DIVISION.

           MOVE "AMANDA"   TO WRK-NOME.
           MOVE 1200       TO WRK-SALDO.
           DISPLAY WRK-NOME WRK-SALDO.
           DISPLAY "SALDO " WRK-SALDO.
           STOP RUN.