       IDENTIFICATION DIVISION.
       PROGRAM-ID. teste.
      *****************************
      * AREA DE COMENTARIOS - REMARKS
      * AUTOR LUCAS OLIVEIRA DOS SANTOS (LOS)
      *OBJETIVO: RECEBER NOME E SALARIO
      *IMPRIMIR FORMATADO 
      *DATA = 10/09/2025
      *****************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-NOME PICTURE X(20) VALUE SPACES.
       77 WRK-SALARIO PICTURE 9(06)V99 VALUE ZEROS.
       77 WRK-SALARIO-ED PICTURE $ZZZ.Z99,99 VALUE ZEROS.
       PROCEDURE DIVISION.
           ACCEPT WRK-NOME FROM CONSOLE.
           ACCEPT WRK-SALARIO FROM CONSOLE.
      ***************************** MOSTRA DADOS ***********************    
           DISPLAY "NOME " WRK-NOME.
           MOVE WRK-SALARIO TO WRK-SALARIO-ED.
           DISPLAY "SALARIO " WRK-SALARIO-ED.
           STOP RUN.
